[
    {
        "everyone": "", 
        "room": "Franklin 2", 
        "title": "There is no CMS", 
        "id": "1", 
        "length": "1 hour", 
        "scheduleblock": "thursday-am-1", 
        "time": "11am-noon", 
        "leader": "Matt Boggie and Alexis Lloyd", 
        "day": "Thursday", 
        "description": "Anyone who’s written for the web has encountered content management systems: complex monoliths of templates, business rules and workflow that take words and media and transform them into the pages and articles our readers see. Anyone who has worked with these systems for long is also familiar with their flaws, their temperamental assumptions about the world, their frustrating constraints, their sometimes-incomprehensible syntax and controls. Even when they work well, they are monolithic systems that represent fossilizations of earlier processes, and are painful to augment and extend.\n\nThis session will be to convene a discussion about what’s wrong with CMSes -- both the systems themselves and the very concept of CMS -- and some possible solutions. What could be possible when we begin to think beyond the CMS as we know it? What systems or protocols could we create that might not be subject to the same problems and limitations? The New York Times R&D Lab will also present some early work showing what an (admittedly futuristic) alternative could look like."
    }, 
    {
        "everyone": "", 
        "room": "Franklin 1", 
        "title": "Super Mappin': Pushing the limits of online maps with raster data, OSM and CSV", 
        "id": "2", 
        "length": "2.5 hours", 
        "scheduleblock": "thursday-am-1", 
        "time": "11am-1:30pm", 
        "leader": "Al Shaw, Jue Yang, Derek Lieu, Ian Dees", 
        "day": "Thursday", 
        "description": "Online mapping is going through a quiet revolution. When we first started putting interactive maps on the web, we had only a single toggle between Google’s political and secret-sauce “satellite” view. All the data was proprietary, and working with it meant dropping pins and painstaking line-tracing.\n\nToday, there’s a dizzying array of tools and data sources.\n\nMapbox’s Cloudless Atlas turns NASA Landsat 8 imagery into a gorgeous mosaic. Startups like Planet Labs and Skybox are deploying whole fleets of imaging satellites attached to easy-to-use APIs. OpenStreetMap has reached a million users, a community that contributes and maintains the ever-growing store of infrastructure and road network data.\n\nThe growing competency of frontend mapping tools has made mapping in-browser streamlined. GeoJSON, leaflet.js, easy MapBox hosting, and the all-purpose data-driven-document framework (aka d3.js), have all facilitated the process of \"making a map\" with large amounts of data.\n\nHow can (and should) we use these data and tools in our reporting? And how do we present our findings? In this session we will discuss deeply the world of mapping - with raster and non-raster data, and its architecture in the browser. We will cover strategies and algorithms that make imagery quantifiable, points-of-interest data patterns-of-interest, and ways to load them into the browser for wide distribution via something called the internet.\n\nWe'll break into smaller groups to demonstrate hands-on techniques after our discussion"
    }, 
    {
        "everyone": "", 
        "room": "Haas", 
        "title": "Who are we missing?", 
        "id": "3", 
        "length": "1 hour", 
        "scheduleblock": "thursday-am-1", 
        "time": "11am-noon", 
        "leader": "Mandy Brown", 
        "day": "Thursday", 
        "description": "There are people who aren't at SRCCON this year who should be here in a year or two. How do we bring them in? This will be a fact-finding session dedicated to articulating pathways into data journalism and newsroom code. What skills do people need? What are the various avenues in to the field? What resources are available to help newcomers? Or, what resources are lacking? Most importantly, how do we make this a welcome space for people with different backgrounds and experiences?"
    }, 
    {
        "everyone": "", 
        "room": "Garden 1", 
        "title": "How NOT to skew with statistics: drafting, data bulletproofing, and tools for well-*developed* stories", 
        "id": "4", 
        "length": "1 hour", 
        "scheduleblock": "thursday-am-1", 
        "time": "11am-noon", 
        "leader": "Aurelia Moser and Chris Keller", 
        "day": "Thursday", 
        "description": "There’s always a lot of press-stress about interactives that are misleading and skew the data they are intending to represent. There’s also a million ways that different newsrooms homebrew the bulletproofing process, and plan for how to present information with maximum integrity. How do modern news orgs navigate deceptive data and manage to provide critical readings of complicated information? This will be a session about ways that statistics can be charted and plotted and how to make sure that we prep our data appropriately for interactive projects. We’ll also run through process models that we might adopt to make fact-checking and peer review an open and organization-agnostic process. Beyond citing sources and licensing intents to prove validity, we’ll talk about how we package information in an interactive story and the protocols for making sure that honest representation is clear and concise in the various vocabularies we use to communicate the news. Have some things to contribute, tools to solicit feedback on, or just want to listen in and learn? Join us; everyone will walk away with a stack of resources, a collaboratively-assembled and forkable guide/glossary for how to tackle data; we'll workshop this in session.\n\nEtherpad for this session: https://etherpad.mozilla.org/bOwBSAeLe5"
    }, 
    {
        "everyone": "", 
        "room": "Garden 2", 
        "title": "Closing the gaps: Let's identify the holes in open data, then fix them", 
        "id": "5", 
        "length": "1 hour", 
        "scheduleblock": "thursday-am-1", 
        "time": "11am-noon", 
        "leader": "Waldo Jaquith", 
        "day": "Thursday", 
        "description": "There are some crucial tools and datasets that really need to exist, but don't. Address normalization is a crapshoot. Getting text out of PDFs is terrible, and it's not getting any better. It's impractical to share, manipulate, or analyze enormous datasets. Municipal geodata has to be obtained, individually, from each municipality. And so on. Anybody who works with open data has their own pet peeve.\n\nLet's have a gripe session about things that are terrible, and then let's figure out how to make those things stop being terrible. The US Open Data Institute has the resources and the mandate to start addressing these problems, but we want to solve the important problems."
    }, 
    {
        "everyone": "", 
        "room": "Garden 3", 
        "title": "Releasing data trapped in PDFs with your community", 
        "id": "6", 
        "length": "1 hour", 
        "scheduleblock": "thursday-am-1", 
        "time": "11am-noon", 
        "leader": "Gabriela Rodriguez", 
        "day": "Thursday", 
        "description": "Sometimes we have PDF documents that are impossible to convert into text with the common tools. If you have a scanned PDF then it may be hard to find an OCR tool that can convert it. And you need the data to process, visualize and use in your investigation. Then we can use the power of your community. Call your community to crowdsource the conversion of PDF documents. That is what we did with the senate spendings at La Nacion. The project is called VozData and the software that created it is called Crowdata. This session is going to be a techy one about how to use crowdata in your newsroom."
    }, 
    {
        "everyone": "", 
        "room": "Franklin 2", 
        "title": "Two million dollars and one hour: Can you design a new news org that doesn’t shit the bed?", 
        "id": "7", 
        "length": "1 hour", 
        "scheduleblock": "thursday-am-2", 
        "time": "12:30-1:30pm", 
        "leader": "Dan Sinker", 
        "day": "Thursday", 
        "description": "It’s clear that there’s demand for new approaches to news, so why have so many of the new news organizations fallen down after high-profile launches? Given the talent at SRCCON, can we sketch a new news organization that (1) produces high-quality news, (2) does it in new ways, and (3) is profitable? And can we do it in an hour.This highly interactive session will divide the room into small teams that will discuss both concept and budget for their news org. All teams will give a one-minute pitch at the end of the session."
    }, 
    {
        "everyone": "", 
        "room": "Haas", 
        "title": "The Hitchhiker's Guide to datasets", 
        "id": "8", 
        "length": "1 hour", 
        "scheduleblock": "thursday-am-2", 
        "time": "12:30-1:30pm", 
        "leader": "Ryan Pitts", 
        "day": "Thursday", 
        "description": "There are great stories just waiting to be mined from big, traditional datasets, but it can be scary to dig in when you don't know the jargon and nobody left a map. Take the American Community Survey: hundreds of tables full of fascinating data, but before you start reporting with confidence, you need to know about summary levels and table universes, the difference between the 1-year/3-year/5-year releases, and why you should never compare, say, 2012 3-year data against 2011 3-year data.\n\nI can get you caught up on those concepts ... but then I couldn't tell you a *thing* about FEC data. You know who can, though? Derek Willis. And Jake Harris knows AP election data so well he’s taken all the excitement out of the load process. We all know the secrets and traps hidden in the datasets we've spent the most time with; I'll bet you know something just like this that no one else at SRCCON does. So let's start making a guide together by talking about the data each one of us knows well.\n\nFor this session, we'll cover the basics of:\n\n* Census data from the American Community Survey: Joe Germuska and Ryan Pitts\n* Campaign finance data from the Federal Election Commission: Derek Willis\n* Elections data from the Associated Press: Jacob Harris\n\nAnd we'll also talk about:\n\n* Your favorite dataset: You\n\nWe should also try to capture this background information. Between now and SRCCON, I'll get a GitHub repository up and running so people can contribute dataset tipsheets in simple way, even if they can't make the conference. Charlie Ornstein from ProPublica's already agreed to write up some background on using Medicare data even though he won't be at SRCCON. Let's help each other out like that and make something neat."
    }, 
    {
        "everyone": "", 
        "room": "Garden 1", 
        "title": "Using web type: pitfalls and workarounds", 
        "id": "9", 
        "length": "1 hour", 
        "scheduleblock": "thursday-am-2", 
        "time": "12:30-1:30pm", 
        "leader": "Allen Tan", 
        "day": "Thursday", 
        "description": "The use of custom typefaces are commonplace online, but it still doesn’t just work. This session will be an overview of the different situations where things can behave differently from what you’d expect and how to deal with them.\n\n- Font stacks and consistent type size\n- Loading webfonts synchronously vs asynchronously\n- Unicode and selective glyph removal\n- Text rasterization on Windows: GDI vs DirectWrite\n- Different antialiasing modes, type “bleeding” and white type on dark backgrounds\n- New OpenType features available to web browsers\n- Using SVG together with webfonts"
    }, 
    {
        "everyone": "", 
        "room": "Garden 2", 
        "title": "What is our role in the open data movement?", 
        "id": "10", 
        "length": "1 hour", 
        "scheduleblock": "thursday-am-2", 
        "time": "12:30-1:30pm", 
        "leader": "AmyJo Brown and Casey Thomas", 
        "day": "Thursday", 
        "description": "Open data is an idea gaining traction in local governments, with cities in particular beginning to embrace policies that could make public information much easier to acquire.\n\nTwo great examples of how this is playing out are here in Pennsylvania, in Philadelphia and Pittsburgh. The cities are crafting legislation and making hires to engage the community in the decision-making about what public data should be released when and how.\n\nThat process raises many questions. In this session, we’re going to explore those questions and what our role, as journalists/news organizations, should be in the open data movement.\n\nOur goal is to craft a set of guidelines and/or a list of questions that journalists and news shops can use to guide their internal conversations about working with cities and local groups such as the Code for America brigades.\n\nA few topics we’d like to discuss:\n\n* How should we define our relationship with the tech communities / open data enthusiasts? We are experienced at working with government data and understand the challenges, pitfalls and potential power of using it to tell stories about our communities. Should we be lending our expertise and partnering? Or should we remain independent observers and fact-checkers of their work, treating them as another beat to cover? What are the pros and cons?\n* What ethical quandaries might we find ourselves in and how should we define the boundaries? (i.e., participating in beta testing / when and how to scrape government sites … others?)\n* The open data groups have already proven to be a powerful lobby on behalf of freedom of information laws. How should we work with them to ensure that local and state laws continue to be friendly and more open? On the flip side, how should we prepare to mitigate the risks of more restrictive laws being enacted if an open data experiment goes wrong (i.e., backlash against certain information being published or interpreted and published incorrectly?)\n* If we talk of partnering, what are the ways (are there ways?) we can balance our business interests with the open data ethos?\n\nWe’re sure other topics will also come up during our session. We’ll discuss and then document our conversation to help develop a framework for others in similar situations."
    }, 
    {
        "everyone": "", 
        "room": "Franklin 2", 
        "title": "Before we can fix the news, we need to redesign the newsroom", 
        "id": "11", 
        "length": "2.5 hours", 
        "scheduleblock": "thursday-pm-1", 
        "time": "3-5:30pm", 
        "leader": "Tom Meagher", 
        "day": "Thursday", 
        "description": "Most newsrooms don't employ developers. In the lucky places with developers who are allowed to work on news projects, these journalists have a litany of common complaints: nobody understands what I do, nobody understands how databases/the internet/computers work, nobody respects how much time it takes to do this kind of work well. \n\nThere are a lot of reasons for this that we won't be able to solve in an hour, but one legacy we need to overcome is the firmly entrenched organization and management structure of the newspaper itself. For 100 years, reporters sat together with their colleagues who covered the same beat. They reported a story, wrote it up and handed it to an editor who read it. He (almost always a he), edited it, demanded a photo or chart to illustrate it, and then handed it to the copy desk to fix typos and place on a page in the next morning's paper. Repeat for another 40 years until you drop dead at your desk. \n\nObviously, nearly everything about our readers and our industry has changed dramatically in the past three decades, but our newsroom structures are remarkably unchanged. In some places, there may be a separate \"digital\" wing lashed on to the side of the org chart, or a \"real-time\" desk that handles web production. In many newsrooms, reporters report (and tweet and shoot video...), write and hand their product off to someone else to put on the web and in print. They are utterly divorced from doing anything online outside of a rigid CMS.\n\nAs journalist-developers, we know how to build apps for the web. We can visualize data and design engaging user experiences on tablet or mobile. In this session, I'd like us to talk about how we can redesign the newsroom itself to upend our clunky workflows pegged to Sunday's newspaper instead of today's news online. \n\nIf you were the editor of your average major metro daily, how would you redraw your organization to make this work?\n*How can we redesign our newsrooms to bring news developers into the reporting process at the beginning and to help everyone else master new skills? \n* Should we adopt Ben Welsh's philosophy that we ought to train web producers to become news devs and not just SEO-experts and explainer explainers? \n* Should we follow Scott Klein's model of making every developer a reporter, designer and data expert?\n* How many AMEs do you really need? \n* Should web producers sit together or with the copy desk and paginators? Should they be in the same room/floor/building/state as reporters and editors? \n* What are the jobs that really need to be done here?\n\nThis exercise is about more than just rearranging deck chairs. Together, we can wipe the slate clean and design a newsroom that builds skills throughout the organization and forces people to think smarter about the internet as a primary medium rather than an afterthought."
    }, 
    {
        "everyone": "", 
        "room": "Franklin 1", 
        "title": "Human-driven design: how to know your users and build just what they need", 
        "id": "12", 
        "length": "1 hour", 
        "scheduleblock": "thursday-pm-1", 
        "time": "3-4pm", 
        "leader": "Sara Schnadt and Ryan Pitts", 
        "day": "Thursday", 
        "description": "How do you decide what to build? What does your process look like before you write a line of code? How do users’ needs, desires, skills, and workflows inform how you imagine your solutions and refine them along the way? How do you invite users into your process and be sure that your finished work meets their expectations? \n\nAnd, how can you do all this and also be the creative visionary type who says “hey, they asked for a faster horse-drawn carriage but instead we built them a car”?\n\nLet’s kick around questions like this, and talk about how we build innovative tools for journalists that meet users’ needs on their own terms. We’ll share how we identified the types of journalists we wanted to serve through Census Reporter, then researched, designed, reached out, cajoled, built, took criticism, reworked, and ultimately made a tool that serves up a complex data set with a simple interface. And then we want to hear about your process. How do *you* plan what *you’re* going to build next?"
    }, 
    {
        "everyone": "", 
        "room": "Haas", 
        "title": "Sartre was wrong: Hell is data about other people", 
        "id": "13", 
        "length": "2.5 hours", 
        "scheduleblock": "thursday-pm-1", 
        "time": "3-5:30pm", 
        "leader": "Derek Willis", 
        "day": "Thursday", 
        "description": "Data about people is all around us. It also comes in countless varieties of formats, with \"unique\" identifiers that aren't or no identification system at all. We all have to deal with people data in our reporting and applications. How do we do it? What are the best (and worst) tools and libraries? What about determining gender? This session is designed to unearth the practices that we use for handling personal identifiers and to find the best ones or to figure out where the unmet needs are, and try to start solving them. Open to any and all languages and platforms."
    }, 
    {
        "everyone": "", 
        "room": "Garden 1", 
        "title": "Interactives and climate change", 
        "id": "14", 
        "length": "1 hour", 
        "scheduleblock": "thursday-pm-1", 
        "time": "3-4pm", 
        "leader": "Brian Jacobs", 
        "day": "Thursday", 
        "description": "In a 2006 Washington Post editorial, referring to carbon emissions reduction, Bill McKibben wrote, \"there are no silver bullets, only silver buckshot.\" It's a sentiment that reflects the complexity of anthropogenic climate change, and it's relevant to any of us that are thinking about how to use our skills towards a climate change project. Rather than feel overwhelmed and paralyzed by the scale of the issue, we can try to address pieces of the problem from different angles, and do so over time. As designers and developers with a public audience, we can make an impact on public and political perceptions of climate issues in more accessible ways than scientists alone can achieve. But how can we best spend our energy doing so?\n\nWhen considering projects...\n* What topics are the most pressing to address, in international or domestic contexts?\n* What are some small projects that can be tackled by individuals or smaller teams?\n* What audiences are we best catering to: the general public, politicians, children?\n* What existing tools can be used to accelerate the production of climate-related interactives?\n* What tools don't already exist but should?\n* What are some great tapped or untapped datasets?\n\nConsidering the decades of research on climate change...\n* In psychological, sociological, and media studies research on climate communication, how does the public respond towards particular patterns, phrases, and design decisions when expressing climate change concepts?\n* What are the best existing examples of local and global climate stories and visualization, and what can we learn from them? What are the worst and why?\n* What communication lessons can be learned from climatologists, urban planners, and governmental organizations in their understanding of how populations will be affected by changing conditions? How can we improve on their techniques of expressing domain knowledge?"
    }, 
    {
        "everyone": "", 
        "room": "Garden 2", 
        "title": "Data processing pipeline show & tell", 
        "id": "15", 
        "length": "1 hour", 
        "scheduleblock": "thursday-pm-1", 
        "time": "3-4pm", 
        "leader": "Ted Han and Jacqui Maher", 
        "day": "Thursday", 
        "description": "DocumentCloud is only one of many examples of data processing pipelines in the pursuit of journalism. There are many other examples, open source (Census Reporter, PANDA, Fech) and proprietary (http://datadesk.latimes.com/posts/2013/12/natural-language-processing-in-the-kitchen/ ), large to small (medicare reimbursement data to daily arrest records)\n\nRather than talking about the extract, load, transform workflows in abstract, lets talk about what makes your (or someone else's) processing pipeline interesting! Were there special considerations around how the data was gathered? Any unique constraints on how the data needed to be analyzed or presented? Was the data so large that custom code and tools were necessary.\n\nData collection for this session: https://docs.google.com/forms/d/1DVgT6T6aeopENm27zoQVoBqRmHPClQDJB4j-SYhJY8s/viewform"
    }, 
    {
        "everyone": "", 
        "room": "Garden 3", 
        "title": "Mapping influence in investigations", 
        "id": "16", 
        "length": "1 hour", 
        "scheduleblock": "thursday-pm-1", 
        "time": "3-4pm", 
        "leader": "Friedrich Lindenberg and Annabel Church", 
        "day": "Thursday", 
        "description": "Influence mapping tools like LittleSis, Poderopedia and even Gephi have been around for a while and applied in many different contexts. But while these tools have been used to create nice network diagrams and profile pages, they aren't really a meaningful part of journalistic workflows yet. In this session, I want to brainstorm ideas on what is needed to make social network analysis tools not just a fancy form of visualising the outcomes of investigations, but an actual tool to manage evidence, ask journalistic questions and derive unexpected insights.\n\nTo kick off the discussion, I'll quickly introduce the connectedAfrica project, which maps out politically exposed persons in African countries. I'll also demo the grano toolkit, which Code for Africa is building in collaboration with the KnightLab, Poderomedia and others to collect, structure and analyse journalistic network data."
    }, 
    {
        "everyone": "", 
        "room": "Franklin 1", 
        "title": "Art directing posts, sustainably", 
        "id": "17", 
        "length": "1 hour", 
        "scheduleblock": "thursday-pm-2", 
        "time": "4:30-5:30pm", 
        "leader": "Scott Kellum and Lauren Rabaino", 
        "day": "Thursday", 
        "description": "Beautifully designed longform articles are a hot topic right now but \nmaking them work efficiently and at scale is still a hard problem to \nsolve. At Vox Media we have been building and refining longform \njournalism and art directed posts for years in a way that we can do a \nlot of big things at a large scale without putting a strain on our \ndesigners and developers. In this discussion we will identify common \nproblems we have with process and think on solutions to those problems."
    }, 
    {
        "everyone": "", 
        "room": "Garden 1", 
        "title": "Science vs. data journalism", 
        "id": "18", 
        "length": "1 hour", 
        "scheduleblock": "thursday-pm-2", 
        "time": "4:30-5:30pm", 
        "leader": "Noah Veltman", 
        "day": "Thursday", 
        "description": "There are lots of differences between journalism and research science. Scientists are largely writing for an audience of expert peers, not the general public. They work on long time scales, not one-day deadlines. They frequently design experiments and collect their own data rather than inheriting data from someone else.There's a growing perception of data journalism as edging closer to science. This is kind of dangerous; data journalism can wind up carrying the veneer of scientific rigor without the real thing.Let’s talk about it.Can journalists better adopt the norms of the scientific community, like openness, peer review, reproducibility, incremental discovery, and uncertainty? Should they? What are the tradeoffs?Is there room for data journalism to become more experiment-driven? Should we be creating more of our own data? Can we move beyond casual \"crowdsourcing\" projects into the realm of more rigorous science?"
    }, 
    {
        "everyone": "", 
        "room": "Garden 2", 
        "title": "Make your devs & teams braver through devops (God help us all)\n", 
        "id": "19", 
        "length": "1 hour", 
        "scheduleblock": "thursday-pm-2", 
        "time": "4:30-5:30pm", 
        "leader": "JP Schneider and Chris Chang", 
        "day": "Thursday", 
        "description": "DevOps isn’t about certain tools or processes, but is instead about culture (admittedly a culture obsessed with animated gifs). If you don’t have DevOps staff, how can DevOps still help you? If you do, how can DevOps help you more?"
    }, 
    {
        "everyone": "", 
        "room": "Franklin 2", 
        "title": "Make your own security blanket", 
        "id": "20", 
        "length": "1 hour", 
        "scheduleblock": "friday-am-1", 
        "time": "11am-noon", 
        "leader": "Jeff Larson", 
        "day": "Friday", 
        "description": "Computer security is a hard problem, and the tools we have to deal with it are confusing, highly technical, and often broken. If you work in news -- in any capacity -- this is a dangerous situation. There are always sensitive sources whether they are informing on a local police department or from a warzone or on national security matters. So, lets talk about communicating securely, why security is so important, and how our community can help."
    }, 
    {
        "everyone": "", 
        "room": "Franklin 1", 
        "title": "Toward web-native storytelling!", 
        "id": "21", 
        "length": "1 hour", 
        "scheduleblock": "friday-am-1", 
        "time": "11am-noon", 
        "leader": "Claire O'Neill and Chris Groskopf", 
        "day": "Friday", 
        "description": "Alberto Cairo recently wrote: \"Data journalists cannot survive in a cocoon.\" Likewise, facts and data can't survive without a story, a history, context, nuance and narrative. But also, the modern storyteller can't exist without technical knowledge. We all know this -- but sometimes it's easy to forget in the daily grind. It's hard to do all the things in a fast-paced newsroom! \n\nHow can people who code, and people who don't, think collaboratively and holistically about storytelling? NPR's Visuals team is testing one solution: An integrated content team. We come together on projects as coders, designers, photographers and content specialists (reporter/editors). Sometimes it works, sometimes it doesn't.\n\nWe can kick off this session with a case study of a project we've built. What went well? What went … less well? \n\nWhat works well and ... less well for you and your team? What are the sticking points for \"content\" people working with programmers, and vice-versa? (And are we really so different?)\n\nAnd, most importantly, who is it all even for?"
    }, 
    {
        "everyone": "", 
        "room": "Haas", 
        "title": "Building exoskeletons for reporters", 
        "id": "22", 
        "length": "2.5 hours", 
        "scheduleblock": "friday-am-1", 
        "time": "11am-1:30pm", 
        "leader": "Jeremy Bowers and Aaron Williams", 
        "day": "Friday", 
        "description": "Beat reporters are the great treasure of the modern newsroom. Sadly, many of our digital projects start and end with editors. I propose that we take some time to discuss practical methods for outfitting our beat \nreporters with robotic exoskeletons — digital tools that make a beat reporter stronger, faster and smarter.\n\nWe'll break the class up into two sessions. In the first session, we'll plot what we want to make -- identify beats and tools that would assist in those beats. In the second session, we'll take those beats/tools and start working on prototypes. \n\nIf you're a reporter, editor or someone interested in digital strategy, you'll definitely want to be in the first session, but we'd love to have you around for the second session too. If you're a developer or a designer or a project manager, you'll definitely want to stick around for the second session. "
    }, 
    {
        "everyone": "", 
        "room": "Garden 1", 
        "title": "Opening your code for newsrooms to use", 
        "id": "23", 
        "length": "2.5 hours", 
        "scheduleblock": "friday-am-1", 
        "time": "11am-1:30pm", 
        "leader": "Gabriela Rodriguez and Jeremy B. Merrill", 
        "day": "Friday", 
        "description": "This session will be a place to discuss tips and best practices to release the code you are writing, for newsrooms to use. It will be related to writing code as well as steps to release the code (examples, documentation, tutorials). The outcome will be a guide on how to open your software."
    }, 
    {
        "everyone": "", 
        "room": "Garden 2", 
        "title": "Building smart newsroom tools: how a culture can make or break your internal tools", 
        "id": "24", 
        "length": "1 hour", 
        "scheduleblock": "friday-am-1", 
        "time": "11am-noon", 
        "leader": "Melody Kramer", 
        "day": "Friday", 
        "description": "If you build the world's best tool -- but your newsroom isn't ready for the tool, can't find time to use the tool, doesn't understand the tool, or can't share learnings from the tool, then what's the point?\n\nIn this interactive workshop, we'll talk about how to integrate the people from your newsroom into the development process so that you launch your product with enthusiastic and optimistic supporters. We'll brainstorm strategies, talk about UX principles and sketch out ways to create a product launch that will be successful from the start."
    }, 
    {
        "everyone": "", 
        "room": "Garden 3", 
        "title": "Hands-on: wrangling live data the easy way with Streamtools", 
        "id": "25", 
        "length": "2.5 hours", 
        "scheduleblock": "friday-am-1", 
        "time": "11am-1:30pm", 
        "leader": "Mike Dewar, Nik Hanselman, and Jacqui Maher", 
        "day": "Friday", 
        "description": "How do you deal with LIVE data? How do you explore it, use it, and shape it into something useful? Streamtools provides a friendly interface that lets you explore live sources of data without having to perform complex infrastructure tasks. \n\nThis workshop will introduce the basics of using streamtools:\ninterrogate live sources of data\nbuild systems to track, aggregate and learn from various sources of data\nimport / export processing patterns and explore the streamtools API\nhook into existing systems and create new streams of data\n\nall from within a browser-based graphical interface!"
    }, 
    {
        "everyone": "", 
        "room": "Franklin 2", 
        "title": "How to diversify the pipeline of journo-coders", 
        "id": "26", 
        "length": "1 hour", 
        "scheduleblock": "friday-am-2", 
        "time": "12:30-1:30pm", 
        "leader": "Emma Carew Grovum and Latoya Peterson", 
        "day": "Friday", 
        "description": "The need for more diversity in journalism, specifically in web/coding/tech teams, is indisputable. Let’s talk solutions and find tangible things we can do and encourage others to do to make a difference. What’s worked for people who have had success? What can we try with our next mentee, hire, or opportunity to recommend a speaker? For newsrooms to actually become more diverse, everyone needs to contribute: hiring, managing, promoting, mentoring, teaching, and just generally creating a culture that is welcoming and open.\n\nIf your newsroom is grappling with these issues, if you personally have pondered these questions, or you've had success and want to share it, come on in. "
    }, 
    {
        "everyone": "", 
        "room": "Franklin 1", 
        "title": "Mobile is the future / mobile sucks / the future sucks", 
        "id": "27", 
        "length": "1 hour", 
        "scheduleblock": "friday-pm-2", 
        "time": "4:30-5:30pm", 
        "leader": "Alastair Coote", 
        "day": "Friday", 
        "description": "Mobile is the future. There can’t really be any argument about that now - mobile audience shares just keep on rising and if your audience isn’t over 50% mobile yet, it will be soon. There’s only one problem: developing for mobile sucks.We'll gather together, group therapy style, and talk out some of the biggest mobile challenges, in areas like:- Small screen sizes and orientation changes- Restrictions on video and audio functionality- Cross-platform testing and debugging- Touch events (and the lack of mouse events)- Connectivity issues and performance restrictionsand plenty more besides. Bring your own horror stories and solutions to share. We'll get through this together."
    }, 
    {
        "everyone": "", 
        "room": "Garden 2", 
        "title": "Style guides: codifying your common interface decisions", 
        "id": "28", 
        "length": "1 hour", 
        "scheduleblock": "friday-am-2", 
        "time": "12:30-1:30pm", 
        "leader": "Alan Palazzolo", 
        "day": "Friday", 
        "description": "Over 6 months ago, we started working on a style guide for our interactive projects, and only a few months ago actually started using it. With it, we have seen the productivity of our small team increase significantly from day one of its use.Style guides are one of many ways to codify common decisions that save time. But with coding these decisions, there are still costs associated with creation, maintenance, overriding, and more. Let’s talk about.What are some examples of style guides? In newsrooms? Outside of newsrooms? Good or bad? Is your newsrooms using a style guide? Why or why not? What technologies do you use to manage these templates? How do you deal with existing web or print style guides in your organization?"
    }, 
    {
        "everyone": "", 
        "room": "Franklin 2", 
        "title": "We can stop fighting the CMS, a round-table discussion", 
        "id": "29", 
        "length": "2.5 hours", 
        "scheduleblock": "friday-pm-1", 
        "time": "3-5:30pm", 
        "leader": "Chris Chang and Andrew Nacin", 
        "day": "Friday", 
        "description": "The content management system (CMS) is the bane of users and developers alike. This current state of affairs is woefully inadequate for where the industry needs to go, and few have any resources to solve it. We have a great opportunity at SRCCON for CMS users and developers to get together and hash out what we want and how to get there.Let’s go around, describe a problem, discuss solutions, and then if we’re lucky, we’ll walk away with some best-practices for how to solve some common problems. As Waldo Jaquith wrote: \"Let's have a gripe session about things that are terrible, and then let's figure out how to make those things stop being terrible.\""
    }, 
    {
        "everyone": "", 
        "room": "Franklin 1", 
        "title": "Making things happen with small teams", 
        "id": "30", 
        "length": "1 hour", 
        "scheduleblock": "friday-pm-1", 
        "time": "3-4pm", 
        "leader": "Kaeti Hinck", 
        "day": "Friday", 
        "description": "For the small news dev team (including teams of one), resources are often scarce and your time can be split between a number of roles. Let's talk about the best strategies to make the most of what we have without feeling hopeless or falling prey to burn out. Let's gather with our small-team peers (even if you're just getting started!) and share what's helped us stay productive, what *doesn't* work, ideas for proving worth to potentially skeptical colleagues, and practical tools to maximize our capabilities."
    }, 
    {
        "everyone": "", 
        "room": "Haas", 
        "title": "Handguns and tequila: avoiding data disasters", 
        "id": "31", 
        "length": "1 hour", 
        "scheduleblock": "friday-pm-1", 
        "time": "3-4pm", 
        "leader": "Justin Myers", 
        "day": "Friday", 
        "description": "There’s a quote attributed to Mitch Ratcliffe: “A computer lets you make more mistakes faster than any invention in human history–with the possible exceptions of handguns and tequila.”One of the dangerous aspects of using data in journalism is the ability to do things with drastic consequences to your reporting without realizing it. (If you do something like this, of course, you hope to find it before you publish.) Just because computers are efficient doesn’t mean they don’t still need solid reporting and editing around just about everything they do.So with that said, what should you watch out for when you or your reporters are working on a data-driven story? What mistakes are especially easy to make, and what can you do to prevent them or at least notice them before it’s too late?This session is about concepts and consequences at a level that helps you ask the right questions of the people actually running your data analysis (which might be you), so the intention is to avoid specific code examples as much as possible in favor of talking through what went wrong—but if the bug fits, explain it!"
    }, 
    {
        "everyone": "", 
        "room": "Garden 1", 
        "title": "Own your analytics", 
        "id": "32", 
        "length": "2.5 hours", 
        "scheduleblock": "friday-pm-1", 
        "time": "3-5:30pm", 
        "leader": "Brian Abelson, Michael Keller, and Stijn Debrouwere", 
        "day": "Friday", 
        "description": "Almost all analytics software has an API and API clients. We'll show people how they can get data from Google Analytics and a few other APIs (GA Live, ChartBeat, Facebook Insights, Google Alerts, Bitly, etc.) as well as how they can get social data from utilities like Pollster, SharedCount.com or the \"raw\" social APIs. We'll then show them how best to organize and join all of this information to create interesting new dashboards, textualizations, visualizations, email reports that respond to events, and even new metrics.\n\nWe'll have example code ready for all of these systems so people\n(1) get a quick overview of how these APIs work and can then\n(2) very quickly move on to actually *doing* things with it.\n\nAt the end of the session, participants should have a clearer path to controlling their own analytics data, integrating numbers from multiple sources, creating more meaningful metrics, and (hopefully) making meaningful decisions informed by data."
    }, 
    {
        "everyone": "", 
        "room": "Garden 2", 
        "title": "New frontiers in javascript: the browser at the bleeding edge", 
        "id": "33", 
        "length": "2.5 hours", 
        "scheduleblock": "friday-pm-1", 
        "time": "3-5:30pm", 
        "leader": "Erik Hinton", 
        "day": "Friday", 
        "description": "Once a second tier environment, the browser has become the de facto standard for innovative applications. Complex distributed systems, high-fidelity 3D games, and rich, real-time editorial tools have all moved to browser-based solutions. But with an expanded domain, comes expanded demands and new difficulties. This session is intended to workshop some of the new and experimental tools aimed at creating optimized, complex browser applications.\n\nWe will discuss and workshop the uses, applications and rough edges around experimental, new technologies such as (but not limited to):\n- React.js and its new rendering paradigm\n- Functional Reactive Programming, especially its manifestations in Elm and, to a lesser extent, RxJS\n- Functional languages with a Javascript backend such as GHCJS, Clojurescript, Idris, and Faye\n- Alternative browser concurrency models (such as CSP) as provided by Clojurescript and ES6 generators\n- Sweet.js and the concept of accelerating Javascript evolution through macros"
    }, 
    {
        "everyone": "", 
        "room": "Franklin 1", 
        "title": "How to train your newsroom", 
        "id": "34", 
        "length": "1 hour", 
        "scheduleblock": "friday-am-2", 
        "time": "12:30-1:30pm", 
        "leader": "Jaeah Lee and Tasneem Raja", 
        "day": "Friday", 
        "description": "Everyone agrees that siloed skills are bad. But unlocking your newsroom's nerd potential is hard. At Mother Jones, we've been developing an in-house skills sharing program that's had a real multiplier effect. Let's trade notes on what you've tried at your shops. We'll start with the philosophy that everyone is both a teacher and a learner. Think about it: a newsroom in which copy editors learn from open-source geeks, and vice versa, is a better newsroom. In this session, let's take software's pair programming model and reimagine it for journalism."
    }, 
    {
        "everyone": "", 
        "room": "Haas", 
        "title": "Let's build a wiki of data smells", 
        "id": "35", 
        "length": "1 hour", 
        "scheduleblock": "friday-pm-2", 
        "time": "4:30-5:30pm", 
        "leader": "Jacob Harris", 
        "day": "Friday", 
        "description": "Help build out a guide to knowing when something's wrong with that shiny new dataset."
    }, 
    {
        "everyone": "1", 
        "room": "Ullyot", 
        "title": "Registration & Breakfast", 
        "id": "36", 
        "length": "", 
        "scheduleblock": "thursday-morning", 
        "time": "9-10am", 
        "leader": "", 
        "day": "Thursday", 
        "description": "Get your badges and get some food (plus plenty of coffee), as you gear up for the first day of SRCCON! Also, this is Philly, so indulge in the mountain of soft pretzels."
    }, 
    {
        "everyone": "1", 
        "room": "Ullyot", 
        "title": "Welcome to SRCCON", 
        "id": "37", 
        "length": "", 
        "scheduleblock": "thursday-morning", 
        "time": "10-10:30am", 
        "leader": "", 
        "day": "Thursday", 
        "description": "Let's kick SRCCON off right, with a welcome, some scene-setting, and a little getting-to-know-you. No songs or trust falls, we promise."
    }, 
    {
        "everyone": "1", 
        "room": "", 
        "title": "Lunch on your own", 
        "id": "38", 
        "length": "", 
        "scheduleblock": "thursday-lunch", 
        "time": "1:30-3pm", 
        "leader": "", 
        "day": "Thursday", 
        "description": "Did you know that Philadelphia is the birthplace of America? Go find out why! There's tons of great food options and more history in a five-square-block radius than you can even believe. Get out and enjoy the heat!"
    }, 
    {
        "everyone": "1", 
        "room": "Ullyot", 
        "title": "Dinner at SRCCON", 
        "id": "39", 
        "length": "", 
        "scheduleblock": "thursday-evening", 
        "time": "5:30-7pm", 
        "leader": "", 
        "day": "Thursday", 
        "description": "It's taco time at SRCCON! We'll be setting up a taco bar with all the best fixin's, mix-ins, and more. Plus, a ton of Pennsylvania beer and ice cream from Little Baby's."
    }, 
    {
        "everyone": "1", 
        "room": "", 
        "title": "Evening sessions", 
        "id": "40", 
        "length": "", 
        "scheduleblock": "thursday-evening", 
        "time": "7-9pm", 
        "leader": "", 
        "day": "Thursday", 
        "description": "It's the SRCCON House Party! We'll have four rooms going with different themes and activities:\n\n* Play games in the Game Room! We'll be running a Magic: The Gathering draft, plus lots of other games to choose from--and bring your own to share and play.\n* Have a topic you're passionate about? Go to the Lightning Talk Room and share your passions in five-minute *slide free* talks!\n* Are you a foodie? Join the legion in the Food Room discussing their favorite recipes, techniques and more.\n* Just want to hack on some stuff? We'll be running a Hack Space for you to share your projects and hack on others."
    }, 
    {
        "everyone": "1", 
        "room": "Ullyot", 
        "title": "Breakfast", 
        "id": "41", 
        "length": "", 
        "scheduleblock": "friday-morning", 
        "time": "10-10:45am", 
        "leader": "", 
        "day": "Friday", 
        "description": "The most important meal of the day (or, at least, the first!), share it with us. Coffee hacking stations will be in full effect today as well, if you're nursing a little too much late-night cheesesteak."
    }, 
    {
        "everyone": "1", 
        "room": "Ullyot", 
        "title": "Lunch at SRCCON", 
        "id": "42", 
        "length": "", 
        "scheduleblock": "friday-lunch", 
        "time": "1:30-3pm", 
        "leader": "", 
        "day": "Friday", 
        "description": "Keep the conversations from this morning going (or chat about something else) while enjoying sandwiches, drinks, and even more soft pretzels on us!"
    }, 
    {
        "everyone": "1", 
        "room": "Ullyot", 
        "title": "Closing", 
        "id": "43", 
        "length": "", 
        "scheduleblock": "friday-evening", 
        "time": "5:30-6pm", 
        "leader": "", 
        "day": "Friday", 
        "description": "This is it. We promise no group sing-along, but we don't promise not to shed a tear or two (probably because we'll be really tired). Help us close out SRCCON and set the stage for what happens next."
    }
]